# -*- coding: utf-8 -*-
"""dataset_analysis.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Cemc0sH-PTMSZM_IN2lZkgeFcQxZZhWR
"""

"""
dataset_analysis.py
Полный разведочный анализ (EDA) датасета для изучения русского как иностранного.
Здесь мы смотрим, как текст зависит от родного языка студента, его уровня и т.д.
"""

import re
import sys
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib.patches as mpatches
import matplotlib.ticker as mticker
import seaborn as sns
from pathlib import Path
from scipy import stats


# Тут я вручную разбила языки по типологическим группам.
#   изолирующие — совсем нет падежей, нет вида (китайский, тайский...)
#   романские — богатая глагольная морфология, но слабая именная
#   германские — аналитические, фиксированный порядок слов
#   агглютинативные — суффиксы как падежи (корейский, финский...)
#   славянские — ближайшие родственники, много общих черт
#   семитские — не-ИЕ, корневая система (арабский)
typology_robust = {
    "chinese":   "Isolating",
    "japonese":  "Isolating",   # да, опечатка в исходных данных, но пусть будет
    "thai":      "Isolating",
    "french":    "Romance",
    "italian":   "Romance",
    "spanish":   "Romance",
    "english":   "Germanic",
    "german":    "Germanic",
    "swedish":   "Germanic",
    "norwegian": "Germanic",
    "korean":    "Agglutinative",
    "finnish":   "Agglutinative",
    "hungarian": "Agglutinative",
    "kazah":     "Agglutinative",
    "сzech":     "Slavic",      
    "bulgarian": "Slavic",
    "arabic":    "Semitic",
    "pushtu":    "Indo-Iranian",
    "hindi":     "Indo-Iranian",
}



# Уровни владения русским по порядку
level_of_rus = ["A1", "A2", "B1", "B2", "C1"]

# Порог для "высокоресурсных" языков: если в датасете меньше 50 текстов — считаем низкоресурсным
high_resource_thr = 50

df = pd.read_csv("dataset_RLC_final_project.csv")

# перестраховка
df = df[df["text"].notna() & (df["text"].str.strip() != "")].copy()

# Превращаем уровень владения в категориальную переменную с правильным порядком
df["level_of_rus"] = pd.Categorical(
    df["level_of_rus"],
    categories=[l for l in level_of_rus if l in df["level_of_rus"].unique()],
    ordered=True,
)

# Определяем типологию для каждого студента по его родному языку
df["typology"] = df["dominant_language"].map(typology_robust).fillna("Other")

# Смотрим, сколько текстов на каждом L1, делим на high/low resource
l1_counts = df["dominant_language"].value_counts()
high_resource = sorted(l1_counts[l1_counts >= high_resource_thr].index.tolist())
low_resource  = sorted(l1_counts[l1_counts <  high_resource_thr].index.tolist())
df["resource"] = df["dominant_language"].apply(
    lambda x: "high" if x in high_resource else "low"
)


# Функции для подсчёта слов, лексического разнообразия и т.п.

def word_count(t):
    """Сколько слов в тексте (просто split по пробелам)."""
    return len(str(t).split())

def ttr(t):
    """Type-Token Ratio: отношение уникальных слов к общему числу.
    Чем выше — тем разнообразнее лексика."""
    tokens = str(t).lower().split()
    return len(set(tokens)) / len(tokens) if tokens else 0.0

def avg_word_len(t):
    """Средняя длина слова в символах (учитываем только буквы)."""
    words = [w for w in str(t).split() if w.isalpha()]
    return np.mean([len(w) for w in words]) if words else 0.0

def sent_count(t):
    """Количество предложений — ищем точки, вопросительные и восклицательные знаки."""
    return max(len(re.findall(r'[.!?]+', str(t))), 1)

def avg_sent_len(t):
    """Средняя длина предложения в словах."""
    return word_count(t) / sent_count(t)

# Применяем эти функции ко всему датасету
df["word_count"]   = df["text"].apply(word_count)
df["ttr"]          = df["text"].apply(ttr)
df["avg_word_len"] = df["text"].apply(avg_word_len)
df["sent_count"]   = df["text"].apply(sent_count)
df["avg_sent_len"] = df["text"].apply(avg_sent_len)


print(f"Total texts:      {len(df)}")
print(f"Unique text_ids:  {df['text_id'].nunique()}")
print(f"L1 groups:        {df['dominant_language'].nunique()}")
print(f"Levels present:   {sorted(df['level_of_rus'].dropna().unique().tolist())}")

print("\nTexts per L1 (with typological group):")
for l1 in l1_order:
    n      = l1_counts.get(l1, 0)
    tag    = "high" if l1 in high_resource else "low "
    typo   = typology_robust.get(l1, "Other")
    share  = n / len(df) * 100
    print(f"  [{tag}]  {l1:12s}  {typo:15s}  n={n:4d}")

print("\nL1 × Level matrix:")
print(df.groupby(["dominant_language", "level_of_rus"], observed=True)
      .size().unstack(fill_value=0).to_string())

print("\nL1 × Background:")
print(df.groupby(["dominant_language", "background"])
      .size().unstack(fill_value=0).to_string())

# Теперь смотрим на средние характеристики текстов
metrics = ["word_count", "ttr", "avg_word_len", "avg_sent_len"]
metric_labels = {
    "word_count":   "Word count",
    "ttr":          "TTR (lexical diversity)",
    "avg_word_len": "Avg. word length (chars)",
    "avg_sent_len": "Avg. sentence length (words)",
}

print("\nMeans by L1:")
print(df.groupby("dominant_language")[metrics].mean().round(3).to_string())
print("\nMeans by level:")
print(df.groupby("level_of_rus", observed=True)[metrics].mean().round(3).to_string())
print("\nMeans by typological group:")
print(df.groupby("typology")[metrics].mean().round(3).to_string())


# Использую непараметрический Kruskal-Wallis, потому что распределения не нормальные
print("\nKruskal-Wallis test — differences by L1:")
for m in metrics:
    groups = [g[m].values for _, g in df.groupby("dominant_language")]
    H, p = stats.kruskal(*groups)
    sig = "significant" if p < 0.001 else ("**" if p < 0.01 else ("*" if p < 0.05 else "ns"))
    print(f"  {metric_labels[m]:40s}  H={H:7.2f}  p={p:.4f}  {sig}")

print("\nKruskal-Wallis test — differences by level:")
for m in metrics:
    groups = [g[m].values for _, g in df.groupby("level_of_rus", observed=True)]
    H, p = stats.kruskal(*groups)
    sig = "significant" if p < 0.001 else ("**" if p < 0.01 else ("*" if p < 0.05 else "ns"))
    print(f"  {metric_labels[m]:40s}  H={H:7.2f}  p={p:.4f}  {sig}")

print(f"\nHigh-resource languages: {high_resource}")
print(f"Low-resource languages:  {low_resource}")

# Смотрим, насколько сильно внутри каждого L1 доминирует один уровень
for l1 in l1_order:
    sub = df[df["dominant_language"] == l1]
    n   = len(sub)
    if n == 0: continue
    lv  = sub["level_of_rus"].value_counts()
    dom, dom_p = lv.index[0], lv.iloc[0] / n
    biased = " >70% one level" if dom_p > 0.70 else ""
    print(f"  {l1:12s}  n={n:4d}  dominant={dom} ({dom_p:.0%}){biased}")
